#!/bin/bash 

# создаём каталог task с вложенными директориями 
mkdir -p task/dir1 task/dir2 task/dir3/dir4 

# изменяем текущую директорию на task 
# можно сделать cd task || exit - если смена директории на task не удастся (например, если директория не найдена), весь скрипт завершится.
# можно сделать cd task && echo "Файл создан!" - для вывода сообщения об успехе
# в принципе, это можно делать для каждой команды...
cd task 

# создаём пустой файл task/dir2/empty
# наличие расширения в UNIX не является обязательным
touch dir2/empty 

# создаём файл task/dir2/hello.sh с таким содержанием: 
# #!/bin/bash 
# echo "$1, привет!"
# пишем в файл сначала шебанг
echo '#!/bin/bash' > dir2/hello.sh
# дописываем в файл в файл текст
echo 'echo "$1, привет!"' >> dir2/hello.sh 

# устанавливаем для task/dir2/hello.sh права rwxrw-r-- 
chmod 764 dir2/hello.sh 

# сохраняем список файлов task/dir2 в task/dir2/list.txt 
ls dir2 > dir2/list.txt 

# копируем содержимое каталога task/dir2 в каталог task/dir3/dir4 
cp -r dir2/* dir3/dir4/ 

# записываем в task/dir1/summary.txt список файлов с расширением *.txt, находящихся в task, включая поддиректории 
find . -name '*.txt' > dir1/summary.txt 

# дописываем в task/dir1/summary.txt содержимое task/dir2/list.txt 
cat dir2/list.txt >> dir1/summary.txt 

# определяем переменную окружения NAME со значением "Всем студентам"
# я так понимаю, на случай, если понадобится использовать "echo $NAME" в каких-то процессах, запущенных в этом сеансе
export NAME="Всем студентам" 

# запускаем task/dir2/hello.sh с переменной окружения NAME в качестве аргумента 
# вывод скрипта должен дописаться в файл task/dir1/summary.txt 
# наш скрипт явялется исполняемым (764)
# делаем передачу значения переменной NAME (как аргумента) скрипту hello.sh. То есть "Всем студентам" будет подставлено вместо "$NAME".
./dir2/hello.sh "$NAME" >> dir1/summary.txt 

# перемещаем с переименованием task/dir1/summary.txt в task/Практическое задание 
mv dir1/summary.txt "Практическое задание" 

# выводим на консоль содержимое файла task/Практическое задание 
cat "Практическое задание" 

# ищем в файле "Практическое задание" строки, которые содержат слово "dir" 
# и затем отсортировываем их 
grep "dir" "Практическое задание" | sort 

# меняем текущую директорию на родительскую для task 
cd ..

# удаляем директорию task со всем содержимым 
rm -rf task 
